<?php

namespace Database\Seeders;

use App\Models\Category;
use App\Models\News;
use Illuminate\Database\Seeder;

class NewsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $category = Category::all();
        
        foreach($category as $item){
            for($i = 1; $i <= 11; $i ++){
                $news = new News();
                $uid = uniqid();
                $news->title = " ২০২১ সালে ছুটি ২২ দিন, ৭ দিনই শুক্র–শনি$i". $uid;
                $news->slug = " ২০২১-সালে-ছুটি-২২-দিন-৭-দিনই-শুক্র–শনি$i".$uid;
                $news->body = "২০২১ সালে সাধারণ ছুটি ১৪ দিন। তার মধ্যে ছয় দিন পড়েছে সাপ্তাহিক ছুটির দিনে। করোনাভাইরাস আগামী কয়েক বছরেও যাবে কি না সন্দেহ। তাই বলে জীবন-জীবিকা তো থেমে থাকবে না। আমি খেলোয়াড় বলে নই; চাকরিজীবী বলেন, ব্যবসায়ী বলেন, রিকশাচালক বলেন—সবার ক্ষেত্রেই একই কথা। সারা বিশ্বে যে করোনা পরিস্থিতি, তাতে লকডাউন এখনো থাকা উচিত বা নিয়মকানুন আরও কঠোর হওয়া উচিত। কিন্তু এ রকম করে আর কত দিন! আমার কথাই যদি বলি, বিসিবির বেতন ছাড়া আমার অন্য কোনো আয় নেই। আমরা যদি না খেলি, আমাদের জন্যও জীবনটা কঠিন হয়ে যায়। আমি মনে করি, যতটুকু সম্ভব সতর্কতা অবলম্বন করে সবারই স্বাভাবিক জীবনের কাজ চালিয়ে যাওয়া উচিত। তবে আগে স্বাস্থ্যনিরাপত্তা নিশ্চিত করতে হবে। বিসিবিকে ধন্যবাদ দেব, প্রেসিডেন্টস কাপ টুর্নামেন্টটা আমরা খুব ভালোভাবে শেষ করতে পেরেছি। আন্তর্জাতিক ক্রিকেট না হোক";
                $news->image = 'demo.jpg';
                $news->meta_tags = "test";
                $news->meta_description = '২০২১ সালে সাধারণ ছুটি ১৪ দিন। তার মধ্যে ছয় দিন পড়েছে সাপ্তাহিক ছুটির দিনে।';
                $news->author_id = 0;
                $news->category_id = $item->id;
                $news->on_featured = 1; 
                $news->status = 1;
                $news->save();
               
            }   
            }   
        }
    }
